Revit 2020 API
UnitFormatUtils Members
Methods
Name | Description
Format(Units, UnitType, Double, Boolean, Boolean)
 Formats a number with units into a string.
Format(Units, UnitType, Double, Boolean, Boolean, FormatValueOptions)
 Formats a number with units into a string.
TryParse(Units, UnitType, String, Double)
 Parses a formatted string into a number with units if possible.
TryParse(Units, UnitType, String, ValueParsingOptions, Double)
 Parses a formatted string into a number with units if possible.
TryParse(Units, UnitType, String, Double, String)
 Parses a formatted string into a number with units if possible.
TryParse(Units, UnitType, String, ValueParsingOptions, Double, String)
 Parses a formatted string into a number with units if possible.
See Also
UnitFormatUtils Class
Autodesk.Revit.DB Namespace